build-essential
ubuntu-restricted-extras
gnome-tweak-tool
gnome-tweaks
cmake
git
zsh
tmux
neofetch
preload
nmap
traceroute
whois
pkg-config
libfreetype6-dev
libfontconfig1-dev
libxcb-xfixes0-dev
libxkbcommon-dev
xsel
neovim
htop
tree
timeshift
vlc
ripgrep
exuberant-ctags
xclip
httpie
silversearcher-ag
nfs-common
net-tools
lm-sensors
curl
nnn
jq
fd-find
software-properties-common
libssl-dev
bison
python-setuptools
libpq-dev
zlib1g-dev
libbz2-dev
libreadline-dev
libsqlite3-dev
libncursesw5-dev
xz-utils
tk-dev
libxml2-dev
libxmlsec1-dev
libffi-dev
liblzma-dev
scrot
